NguyenDuyThan/STM32_GPS_GSM/iTracking2.0_Bootloader/Libraries/FATFS/diskio.c
static inline DWORD socket_is_write_protected(void)
{
	return 0; /* fake not protected */
}

#endif /* SOCKET_WP_CONNECTED */

#if SOCKET_CP_CONNECTED
/* Socket's Card-Present Pin: high = socket empty, low = card inserted */

static void socket_cp_init(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;

	/* Configure I/O for card-present */
	RCC_APB2PeriphClockCmd(RCC_APBxPeriph_GPIO_CP, ENABLE);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_CP;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_CP;
	GPIO_Init(GPIO_CP, &GPIO_InitStructure);
}

static inline DWORD socket_is_empty(void)
{
	return ( GPIO_ReadInputData(GPIO_CP) & GPIO_Pin_CP ) ? socket_state_mask_cp : FALSE;
}

#else

static void socket_cp_init(void)
{
	return;
}

static inline DWORD socket_is_empty(void)
{
	return 0; /* fake inserted */
}

#endif /* SOCKET_CP_CONNECTED */

#if CARD_SUPPLY_SWITCHABLE

static void card_power(BOOL on) /* switch FET for card-socket VCC */
{
	GPIO_InitTypeDef GPIO_InitStructure;
	//if(on)
	{
		GPIO_WriteBit(SDC_PWR_PORT, SDC_PWR_PIN, Bit_SET);
		/***********************/
		GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
		GPIO_InitStructure.GPIO_Pin = SDC_SCK_PIN;
		GPIO_Init(SDC_SCK_PORT, &GPIO_InitStructure);
		GPIO_InitStructure.GPIO_Pin = SDC_MOSI_PIN;
		GPIO_Init(SDC_MOSI_PORT, &GPIO_InitStructure);
		GPIO_InitStructure.GPIO_Pin = SDC_MISO_PIN;
		GPIO_Init(SDC_MISO_PORT, &GPIO_InitStructure);
	}
//	else
//	{
//		GPIO_WriteBit(SDC_PWR_PORT, SDC_PWR_PIN, Bit_RESET);
//		/* All SPI-Pins to input with weak internal pull-downs */
//		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD;
//		GPIO_InitStructure.GPIO_Pin = SDC_SCK_PIN;
//		GPIO_Init(SDC_SCK_PORT, &GPIO_InitStructure);
//		GPIO_InitStructure.GPIO_Pin = SDC_MOSI_PIN;
//		GPIO_Init(SDC_MOSI_PORT, &GPIO_InitStructure);
//		GPIO_InitStructure.GPIO_Pin = SDC_MISO_PIN;
//		GPIO_Init(SDC_MISO_PORT, &GPIO_InitStructure);
//	}
}

#if (STM32_SD_DISK_IOCTRL == 1)
static int chk_power(void) /* Socket power state: 0=off, 1=on */
{
	return GPIO_ReadOutputDataBit(SDC_PWR_PORT, SDC_PWR_PIN);
}
#endif

#else

static void card_power(BYTE on)
{
	on = on;
}

#if (STM32_SD_DISK_IOCTRL == 1)
static int chk_power(void)
{
	return 1; /* fake powered */
}
#endif

#endif /* CARD_SUPPLY_SWITCHABLE */

/*-----------------------------------------------------------------------*/
/* Transmit/Receive a byte to MMC via SPI  (Platform dependent)          */
/*-----------------------------------------------------------------------*/
static BYTE stm32_spi_rw(BYTE out)
{
	/* Loop while DR register in not empty */
	/// not needed: while (SPI_I2S_GetFlagStatus(SDC_SPIx, SPI_I2S_FLAG_TXE) == RESET) { ; }

	/* Send byte through the SPI peripheral */
	SPI_I2S_SendData(SDC_SPIx, out);

	/* Wait to receive a byte */
	while(SPI_I2S_GetFlagStatus(SDC_SPIx, SPI_I2S_FLAG_RXNE) == RESET)
	{
		;
	}

	/* Return the byte read from the SPI bus */
	return SPI_I2S_ReceiveData(SDC_SPIx);
}

/*-----------------------------------------------------------------------*/
/* Transmit a byte to MMC via SPI  (Platform dependent)                  */
/*-----------------------------------------------------------------------*/

#define xmit_spi(dat)  stm32_spi_rw(dat)

/*-----------------------------------------------------------------------*/
/* Receive a byte from MMC via SPI  (Platform dependent)                 */
/*-----------------------------------------------------------------------*/

static BYTE rcvr_spi(void)
{
	return stm32_spi_rw(0xff);
}

/* Alternative macro to receive data fast */
#define rcvr_spi_m(dst)  *(dst)=stm32_spi_rw(0xff)

/*-----------------------------------------------------------------------*/
/* Wait for card ready                                                   */
/*-----------------------------------------------------------------------*/

static BYTE wait_ready(void)
{
	BYTE res;

	Timer2 = 50; /* Wait for ready in timeout of 500ms */
	rcvr_spi();
	do
		res = rcvr_spi();
	while((res != 0xFF) && Timer2);

	return res;
}

/*-----------------------------------------------------------------------*/
/* Deselect the card and release SPI bus                                 */
/*-----------------------------------------------------------------------*/

static
void release_spi(void)
{
	DESELECT();
	rcvr_spi();
}

#ifdef STM32_SD_USE_DMA
/*-----------------------------------------------------------------------*/
/* Transmit/Receive Block using DMA (Platform dependent. STM32 here)     */
/*-----------------------------------------------------------------------*/
static
void stm32_dma_transfer(BOOL receive, /* FALSE for buff->SPI, TRUE for SPI->buff               */
const BYTE *buff, /* receive TRUE  : 512 byte data block to be transmitted
 receive FALSE : Data buffer to store received data    */
UINT btr /* receive TRUE  : Byte count (must be multiple of 2)
 receive FALSE : Byte count (must be 512)              */
)
{
	DMA_InitTypeDef DMA_InitStructure;
	WORD rw_workbyte[] =
	{ 0xffff };

	/* shared DMA configuration values */
	DMA_InitStructure.DMA_PeripheralBaseAddr = (DWORD) (&(SDC_SPIx->DR));
	DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
	DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
	DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
	DMA_InitStructure.DMA_BufferSize = btr;
	DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
	DMA_InitStructure.DMA_Priority = DMA_Priority_VeryHigh;
	DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;

	DMA_DeInit(DMA_Channel_SDC_SPIx_RX);
	DMA_DeInit(DMA_Channel_SDC_SPIx_TX);

	if(receive)
	{

		/* DMA1 channel2 configuration SPI1 RX ---------------------------------------------*/
		/* DMA1 channel4 configuration SPI2 RX ---------------------------------------------*/
		DMA_InitStructure.DMA_MemoryBaseAddr = (DWORD) buff;
		DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;
		DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
		DMA_Init(DMA_Channel_SDC_SPIx_RX, &DMA_InitStructure);

		/* DMA1 channel3 configuration SPI1 TX ---------------------------------------------*/
		/* DMA1 channel5 configuration SPI2 TX ---------------------------------------------*/
		DMA_InitStructure.DMA_MemoryBaseAddr = (DWORD) rw_workbyte;
		DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralDST;
		DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Disable;
		DMA_Init(DMA_Channel_SDC_SPIx_TX, &DMA_InitStructure);

