NguyenDuyThan/STM32_GPS_GSM/iTracking2.0_Bootloader/Libraries/FATFS/diskio.c
	}
	else
	{

#if _FS_READONLY == 0
		/* DMA1 channel2 configuration SPI1 RX ---------------------------------------------*/
		/* DMA1 channel4 configuration SPI2 RX ---------------------------------------------*/
		DMA_InitStructure.DMA_MemoryBaseAddr = (DWORD) rw_workbyte;
		DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;
		DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Disable;
		DMA_Init(DMA_Channel_SDC_SPIx_RX, &DMA_InitStructure);

		/* DMA1 channel3 configuration SPI1 TX ---------------------------------------------*/
		/* DMA1 channel5 configuration SPI2 TX ---------------------------------------------*/
		DMA_InitStructure.DMA_MemoryBaseAddr = (DWORD) buff;
		DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralDST;
		DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
		DMA_Init(DMA_Channel_SDC_SPIx_TX, &DMA_InitStructure);
#endif

	}

	/* Enable DMA RX Channel */
	DMA_Cmd(DMA_Channel_SDC_SPIx_RX, ENABLE);
	/* Enable DMA TX Channel */
	DMA_Cmd(DMA_Channel_SDC_SPIx_TX, ENABLE);

	/* Enable SPI TX/RX request */
	SPI_I2S_DMACmd(SDC_SPIx, SPI_I2S_DMAReq_Rx | SPI_I2S_DMAReq_Tx, ENABLE);

	/* Wait until DMA1_Channel 3 Transfer Complete */
	/// not needed: while (DMA_GetFlagStatus(DMA_FLAG_SDC_SPIx_TC_TX) == RESET) { ; }
	/* Wait until DMA1_Channel 2 Receive Complete */
	while(DMA_GetFlagStatus(DMA_FLAG_SDC_SPIx_TC_RX) == RESET)
	{
		;
	}
	// same w/o function-call:
	// while ( ( ( DMA1->ISR ) & DMA_FLAG_SDC_SPIx_TC_RX ) == RESET ) { ; }

	/* Disable DMA RX Channel */
	DMA_Cmd(DMA_Channel_SDC_SPIx_RX, DISABLE);
	/* Disable DMA TX Channel */
	DMA_Cmd(DMA_Channel_SDC_SPIx_TX, DISABLE);

	/* Disable SPI RX/TX request */
	SPI_I2S_DMACmd(SDC_SPIx, SPI_I2S_DMAReq_Rx | SPI_I2S_DMAReq_Tx, DISABLE);
}
#endif /* STM32_SD_USE_DMA */

/*-----------------------------------------------------------------------*/
/* Power Control and interface-initialization (Platform dependent)       */
/*-----------------------------------------------------------------------*/

static
void power_on(void)
{
	SPI_InitTypeDef SPI_InitStructure;
	GPIO_InitTypeDef GPIO_InitStructure;
	volatile BYTE dummyread;

	RCC_APB2PeriphClockCmd(RCC_APB2Periph_SPI1, ENABLE);
	/* Config PWR pin */
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Pin = SDC_PWR_PIN;
	GPIO_Init(SDC_PWR_PORT, &GPIO_InitStructure);
	/* Config CS pin */
	GPIO_InitStructure.GPIO_Pin = SDC_CS_PIN;
	GPIO_Init(SDC_CS_PORT, &GPIO_InitStructure);

	card_power(1);
	socket_cp_init();
	socket_wp_init();

	for(Timer1 = 25; Timer1;)
		; /* Wait for 250ms */
	/* De-select the Card: Chip Select high */
	DESELECT();

	/* Configure SPI pins: SCK and MOSI with default alternate function (not re-mapped) push-pull */
	GPIO_InitStructure.GPIO_Pin = SDC_SCK_PIN;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_Init(SDC_SCK_PORT, &GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = SDC_MOSI_PIN;
	GPIO_Init(SDC_MOSI_PORT, &GPIO_InitStructure);
	/* Configure MISO as Input with internal pull-up */
	GPIO_InitStructure.GPIO_Pin = SDC_MISO_PIN;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_Init(SDC_MISO_PORT, &GPIO_InitStructure);

	/* SPI configuration */
	SPI_InitStructure.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
	SPI_InitStructure.SPI_Mode = SPI_Mode_Master;
	SPI_InitStructure.SPI_DataSize = SPI_DataSize_8b;
	SPI_InitStructure.SPI_CPOL = SPI_CPOL_Low;
	SPI_InitStructure.SPI_CPHA = SPI_CPHA_1Edge;
	SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;
	SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_256; // 72000kHz/256=281kHz < 400kHz
	SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
	SPI_InitStructure.SPI_CRCPolynomial = 7;

	SPI_Init(SDC_SPIx, &SPI_InitStructure);
	SPI_CalculateCRC(SDC_SPIx, DISABLE);
	SPI_Cmd(SDC_SPIx, ENABLE);

	/* drain SPI */
	while(SPI_I2S_GetFlagStatus(SDC_SPIx, SPI_I2S_FLAG_TXE) == RESET)
	{
		;
	}
	dummyread = SPI_I2S_ReceiveData(SDC_SPIx);

#ifdef STM32_SD_USE_DMA
	/* enable DMA clock */
	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);
#endif
}

static
void power_off(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;

	if(!(Stat & STA_NOINIT))
	{
		SELECT();
		wait_ready();
		release_spi();
	}

	SPI_I2S_DeInit(SDC_SPIx);
	SPI_Cmd(SDC_SPIx, DISABLE);

	card_power(0);

	Stat |= STA_NOINIT; /* Set STA_NOINIT */
}

/*-----------------------------------------------------------------------*/
/* Receive a data packet from MMC                                        */
/*-----------------------------------------------------------------------*/

static BOOL rcvr_datablock(BYTE *buff, /* Data buffer to store received data */
UINT btr /* Byte count (must be multiple of 4) */
)
{
	BYTE token;

	Timer1 = 10;
	do
	{ /* Wait for data packet in timeout of 100ms */
		token = rcvr_spi();
	} while((token == 0xFF) && Timer1);
	if(token != 0xFE)
		return FALSE; /* If not valid data token, return with error */

#ifdef STM32_SD_USE_DMA
	stm32_dma_transfer(TRUE, buff, btr);
#else
	do
	{ /* Receive the data block into buffer */
		rcvr_spi_m(buff++);
		rcvr_spi_m(buff++);
		rcvr_spi_m(buff++);
		rcvr_spi_m(buff++);
	}while (btr -= 4);
#endif /* STM32_SD_USE_DMA */

	rcvr_spi(); /* Discard CRC */
	rcvr_spi();

	return TRUE; /* Return with success */
}

/*-----------------------------------------------------------------------*/
/* Send a data packet to MMC                                             */
/*-----------------------------------------------------------------------*/

#if _FS_READONLY == 0
static BOOL xmit_datablock(const BYTE *buff, /* 512 byte data block to be transmitted */
BYTE token /* Data/Stop token */
)
{
	BYTE resp;
#ifndef STM32_SD_USE_DMA
	BYTE wc;
#endif

	if(wait_ready() != 0xFF)
		return FALSE;

	xmit_spi(token); /* transmit data token */
	if(token != 0xFD)
	{ /* Is data token */

#ifdef STM32_SD_USE_DMA
		stm32_dma_transfer(FALSE, buff, 512);
#else
		wc = 0;
		do
		{ /* transmit the 512 byte data block to MMC */
			xmit_spi(*buff++);
			xmit_spi(*buff++);
		}while (--wc);
#endif /* STM32_SD_USE_DMA */

		xmit_spi(0xFF); /* CRC (Dummy) */
		xmit_spi(0xFF);
		resp = rcvr_spi(); /* Receive data response */
		if((resp & 0x1F) != 0x05) /* If not accepted, return with error */
			return FALSE;
	}

