NguyenDuyThan/STM32_GPS_GSM/iTracking2.0_Bootloader/Libraries/FATFS/diskio.c
	return TRUE;
}
#endif /* _READONLY */

/*-----------------------------------------------------------------------*/
/* Send a command packet to MMC                                          */
/*-----------------------------------------------------------------------*/

static BYTE send_cmd(BYTE cmd, /* Command byte */
DWORD arg /* Argument */
)
{
	BYTE n, res;

	if(cmd & 0x80)
	{ /* ACMD<n> is the command sequence of CMD55-CMD<n> */
		cmd &= 0x7F;
		res = send_cmd(CMD55, 0);
		if(res > 1)
			return res;
	}

	/* Select the card and wait for ready */
	DESELECT();
	SELECT();
	if(wait_ready() != 0xFF)
	{
		return 0xFF;
	}

	/* Send command packet */
	xmit_spi(cmd); /* Start + Command index */
	xmit_spi((BYTE)(arg >> 24)); /* Argument[31..24] */
	xmit_spi((BYTE)(arg >> 16)); /* Argument[23..16] */
	xmit_spi((BYTE)(arg >> 8)); /* Argument[15..8] */
	xmit_spi((BYTE)arg); /* Argument[7..0] */
	n = 0x01; /* Dummy CRC + Stop */
	if(cmd == CMD0)
		n = 0x95; /* Valid CRC for CMD0(0) */
	if(cmd == CMD8)
		n = 0x87; /* Valid CRC for CMD8(0x1AA) */
	xmit_spi(n);

	/* Receive command response */
	if(cmd == CMD12)
		rcvr_spi(); /* Skip a stuff byte when stop reading */

	n = 10; /* Wait for a valid response in timeout of 10 attempts */
	do
		res = rcvr_spi();
	while((res & 0x80) && --n);

	return res; /* Return with the response value */
}

/*--------------------------------------------------------------------------

 Public Functions

 ---------------------------------------------------------------------------*/

/*-----------------------------------------------------------------------*/
/* Initialize Disk Drive                                                 */
/*-----------------------------------------------------------------------*/

DSTATUS disk_initialize(BYTE drv /* Physical drive number (0) */
)
{
	BYTE n, cmd, ty, ocr[4];
	int res = -1;
	if(drv)
	{
		return STA_NOINIT; /* Supports only single drive */
	}
	if(Stat & STA_NODISK)
	{
		return Stat; /* No card in the socket */
	}
	//TermPrint_logSDC("--disk_initialize[START]\r\n");
	power_on(); /* Force socket power on and initialize interface */
	interface_speed(INTERFACE_SLOW);
	for(n = 10; n; n--)
		rcvr_spi(); /* 80 dummy clocks */
	ty = 0;
	//	res = send_cmd(CMD0, 0);
	//	xprintf_log("res send_cmd 1 = %d\r\n", res);
	if(send_cmd(CMD0, 0) == 1)
	{ /* Enter Idle state */
		Timer1 = 100; /* Initialization timeout of 1000 milliseconds */
		res = send_cmd(CMD8, 0x1AA);
		//xprintf_log("res send_cmd 2 = %d\r\n", res);

		//res = 0; //cheat code

		if(res == 1)
		{ /* SDHC */
			for(n = 0; n < 4; n++)
				ocr[n] = rcvr_spi(); /* Get trailing return value of R7 response */
			if(ocr[2] == 0x01 && ocr[3] == 0xAA)
			{ /* The card can work at VDD range of 2.7-3.6V */
				while(Timer1 && send_cmd(ACMD41, 1UL << 30))
					; /* Wait for leaving idle state (ACMD41 with HCS bit) */
				if(Timer1 && send_cmd(CMD58, 0) == 0)
				{ /* Check CCS bit in the OCR */
					for(n = 0; n < 4; n++)
						ocr[n] = rcvr_spi();
					ty = (ocr[0] & 0x40) ? CT_SD2 | CT_BLOCK : CT_SD2;
				}
			}
		}
		else
		{ /* SDSC or MMC */
			//	xprintf_log("SDSC or MMC\r\n");
			if(send_cmd(ACMD41, 0) <= 1)
			{
				//	xprintf_log("SDSC\r\n");
				ty = CT_SD1;
				cmd = ACMD41; /* SDSC */
			}
			else
			{
				//	xprintf_log("MMC\r\n");
				ty = CT_MMC;
				cmd = CMD1; /* MMC */
			}
			while(Timer1 && send_cmd(cmd, 0))
				; /* Wait for leaving idle state */
			if(!Timer1 || send_cmd(CMD16, 512) != 0) /* Set R/W block length to 512 */
				ty = 0;
		}
	}
	CardType = ty;
	release_spi();
	//xprintf_log("ty = %d\r\n", ty);
	if(ty)
	{ /* Initialization succeeded */
		//xprintf_log("Stat = %d\r\n", Stat);
		Stat &= ~STA_NOINIT; /* Clear STA_NOINIT */
		interface_speed(INTERFACE_FAST);
	}
	else
	{ /* Initialization failed */
		power_off();
	}
	//xprintf_log("Stat final = %d\r\n", Stat);
	//DBG_print("sd", "\r\n disk_initialize:Stat=", Stat);
	return Stat;
}

/*-----------------------------------------------------------------------*/
/* Get Disk Status                                                       */
/*-----------------------------------------------------------------------*/

DSTATUS disk_status(BYTE drv /* Physical drive number (0) */
)
{
	if(drv)
		return STA_NOINIT; /* Supports only single drive */
	return Stat;
}

/*-----------------------------------------------------------------------*/
/* Read Sector(s)                                                        */
/*-----------------------------------------------------------------------*/

DRESULT disk_read(BYTE drv, BYTE* buff, DWORD sector, UINT count)
{
	if(drv || !count)
		return RES_PARERR;
	if(Stat & STA_NOINIT)
		return RES_NOTRDY;

	if(!(CardType & CT_BLOCK))
		sector *= 512; /* Convert to byte address if needed */

	if(count == 1)
	{ /* Single block read */
		if(send_cmd(CMD17, sector) == 0)
		{ /* READ_SINGLE_BLOCK */
			if(rcvr_datablock(buff, 512))
			{
				count = 0;
			}
		}
	}
	else
	{ /* Multiple block read */
		if(send_cmd(CMD18, sector) == 0)
		{ /* READ_MULTIPLE_BLOCK */
			do
			{
				if(!rcvr_datablock(buff, 512))
				{
					break;
				}
				buff += 512;
			} while(--count);
			send_cmd(CMD12, 0); /* STOP_TRANSMISSION */
		}
	}
	release_spi();

	return count ? RES_ERROR : RES_OK;
}

/*-----------------------------------------------------------------------*/
/* Write Sector(s)                                                       */
/*-----------------------------------------------------------------------*/

#if _FS_READONLY == 0

DRESULT disk_write(BYTE drv, const BYTE* buff, DWORD sector, UINT count)
{
	if(drv || !count)
		return RES_PARERR;
	if(Stat & STA_NOINIT)
		return RES_NOTRDY;
	if(Stat & STA_PROTECT)
		return RES_WRPRT;

	if(!(CardType & CT_BLOCK))
		sector *= 512; /* Convert to byte address if needed */

	if(count == 1)
	{ /* Single block write */
		if((send_cmd(CMD24, sector) == 0) /* WRITE_BLOCK */
		&& xmit_datablock(buff, 0xFE))
			count = 0;
	}
	else
	{ /* Multiple block write */
		if(CardType & CT_SDC)
			send_cmd(ACMD23, count);
		if(send_cmd(CMD25, sector) == 0)
		{ /* WRITE_MULTIPLE_BLOCK */
			do
			{
				if(!xmit_datablock(buff, 0xFC))
					break;
				buff += 512;
			} while(--count);
			if(!xmit_datablock(0, 0xFD)) /* STOP_TRAN token */
				count = 1;
		}
	}
	release_spi();

	return count ? RES_ERROR : RES_OK;
}
#endif /* _READONLY == 0 */

/*-----------------------------------------------------------------------*/
/* Miscellaneous Functions                                               */
/*-----------------------------------------------------------------------*/

