NguyenDuyThan/STM32_GPS_GSM/iTracking2.0_Bootloader/Libraries/FATFS/diskio.c
#if (STM32_SD_DISK_IOCTRL == 1)
DRESULT disk_ioctl(BYTE drv, BYTE ctrl, void* buff)
{
	DRESULT res;
	BYTE n, csd[16], *ptr = buff;
	WORD csize;

	if(drv)
		return RES_PARERR;

	res = RES_ERROR;

	if(ctrl == CTRL_POWER)
	{
		switch(*ptr)
		{
			case 0: /* Sub control code == 0 (POWER_OFF) */
				if(chk_power())
					power_off(); /* Power off */
				res = RES_OK;
				break;
			case 1: /* Sub control code == 1 (POWER_ON) */
				power_on(); /* Power on */
				res = RES_OK;
				break;
			case 2: /* Sub control code == 2 (POWER_GET) */
				*(ptr + 1) = (BYTE) chk_power();
				res = RES_OK;
				break;
			default:
				res = RES_PARERR;
		}
	}
	else
	{
		if(Stat & STA_NOINIT)
			return RES_NOTRDY;

		switch(ctrl)
		{
			case CTRL_SYNC: /* Make sure that no pending write process */
				SELECT();
				if(wait_ready() == 0xFF)
					res = RES_OK;
				break;

			case GET_SECTOR_COUNT: /* Get number of sectors on the disk (DWORD) */
				if((send_cmd(CMD9, 0) == 0) && rcvr_datablock(csd, 16))
				{
					if((csd[0] >> 6) == 1)
					{ /* SDC version 2.00 */
						csize = csd[9] + ((WORD) csd[8] << 8) + 1;
						*(DWORD*) buff = (DWORD) csize << 10;
					}
					else
					{ /* SDC version 1.XX or MMC*/
						n = (csd[5] & 15) + ((csd[10] & 128) >> 7) + ((csd[9]
								& 3) << 1) + 2;
						csize = (csd[8] >> 6) + ((WORD) csd[7] << 2)
								+ ((WORD) (csd[6] & 3) << 10) + 1;
						*(DWORD*) buff = (DWORD) csize << (n - 9);
					}
					res = RES_OK;
				}
				break;

			case GET_SECTOR_SIZE: /* Get R/W sector size (WORD) */
				*(WORD*) buff = 512;
				res = RES_OK;
				break;

			case GET_BLOCK_SIZE: /* Get erase block size in unit of sector (DWORD) */
				if(CardType & CT_SD2)
				{ /* SDC version 2.00 */
					if(send_cmd(ACMD13, 0) == 0)
					{ /* Read SD status */
						rcvr_spi();
						if(rcvr_datablock(csd, 16))
						{ /* Read partial block */
							for(n = 64 - 16; n; n--)
								rcvr_spi(); /* Purge trailing data */
							*(DWORD*) buff = 16UL << (csd[10] >> 4);
							res = RES_OK;
						}
					}
				}
				else
				{ /* SDC version 1.XX or MMC */
					if((send_cmd(CMD9, 0) == 0) && rcvr_datablock(csd, 16))
					{ /* Read CSD */
						if(CardType & CT_SD1)
						{ /* SDC version 1.XX */
							*(DWORD*) buff = (((csd[10] & 63) << 1)
									+ ((WORD) (csd[11] & 128) >> 7) + 1)
									<< ((csd[13] >> 6) - 1);
						}
						else
						{ /* MMC */
							*(DWORD*) buff
									= ((WORD) ((csd[10] & 124) >> 2) + 1)
											* (((csd[11] & 3) << 3) + ((csd[11]
													& 224) >> 5) + 1);
						}
						res = RES_OK;
					}
				}
				break;

			case MMC_GET_TYPE: /* Get card type flags (1 byte) */
				*ptr = CardType;
				res = RES_OK;
				break;

			case MMC_GET_CSD: /* Receive CSD as a data block (16 bytes) */
				if(send_cmd(CMD9, 0) == 0 /* READ_CSD */
				&& rcvr_datablock(ptr, 16))
					res = RES_OK;
				break;

			case MMC_GET_CID: /* Receive CID as a data block (16 bytes) */
				if(send_cmd(CMD10, 0) == 0 /* READ_CID */
				&& rcvr_datablock(ptr, 16))
					res = RES_OK;
				break;

			case MMC_GET_OCR: /* Receive OCR as an R3 resp (4 bytes) */
				if(send_cmd(CMD58, 0) == 0)
				{ /* READ_OCR */
					for(n = 4; n; n--)
						*ptr++ = rcvr_spi();
					res = RES_OK;
				}
				break;

			case MMC_GET_SDSTAT: /* Receive SD status as a data block (64 bytes) */
				if(send_cmd(ACMD13, 0) == 0)
				{ /* SD_STATUS */
					rcvr_spi();
					if(rcvr_datablock(ptr, 64))
						res = RES_OK;
				}
				break;
#if _USE_ERASE	/* Erase sector */
			case CTRL_ERASE_SECTOR:
//			{
//				DWORD sector = *((DWORD)buff[0]);
//				DWORD count = (buff[1] - buff[0] + 1);
//				if(!(CardType & CT_BLOCK))
//					sector *= 512; /* Convert to byte address if needed */
//
//				if(count == 1)
//				{ /* Single block write */
//					if((send_cmd(CMD24, sector) == 0) /* WRITE_BLOCK */
//					&& xmit_datablock(buff, 0xFE))
//						count = 0;
//				}
//				else
//				{ /* Multiple block write */
//					if(CardType & CT_SDC)
//						send_cmd(ACMD23, count);
//					if(send_cmd(CMD25, sector) == 0)
//					{ /* WRITE_MULTIPLE_BLOCK */
//						do
//						{
//							if(!xmit_datablock(0xFF, 0xFC))
//								break;
//						} while(--count);
//						if(!xmit_datablock(0, 0xFD)) /* STOP_TRAN token */
//							count = 1;
//					}
//				}
//			}
				break;
#endif
			default:
				res = RES_PARERR;
		}

		release_spi();
	}

	return res;
}
#endif /* _USE_IOCTL != 0 */

/*-----------------------------------------------------------------------*/
/* Device Timer Interrupt Procedure  (Platform dependent)                */
/*-----------------------------------------------------------------------*/
/* This function must be called in period of 10ms                        */
void disk_timerproc(void)
{
	static DWORD pv;
	DWORD ns;
	BYTE n, s;

	n = Timer1; /* 100Hz decrement timers */
	if(n)
		Timer1 = --n;
	n = Timer2;
	if(n)
		Timer2 = --n;

	ns = pv;
	pv = socket_is_empty() | socket_is_write_protected(); /* Sample socket switch */

	if(ns == pv)
	{ /* Have contacts stabled? */
		s = Stat;

		if(pv & socket_state_mask_wp) /* WP is H (write protected) */
			s |= STA_PROTECT;
		else
			/* WP is L (write enabled) */
			s &= ~STA_PROTECT;

		if(pv & socket_state_mask_cp) /* INS = H (Socket empty) */
		{
			s |= (STA_NODISK | STA_NOINIT);
		}
		else
			/* INS = L (Card inserted) */
			s &= ~STA_NODISK;

		Stat = s;
	}
}
#if _USE_LFN == 3
/*----------------------------------------------------------------------
 * Brief:
 -----------------------------------------------------------------------*/
void* ff_memalloc (UINT msize)
{
	return MM_get(MIN2SEC(60), msize, 0);
}
/*----------------------------------------------------------------------
 * Brief:
 -----------------------------------------------------------------------*/
void ff_memfree (void* mblock)
{
	MM_free(mblock);
}
#endif // _USE_LFN == 3
#if _FS_REENTRANT
/*----------------------------------------------------------------------
 * Brief: Create a sync object
 -----------------------------------------------------------------------*/
int ff_cre_syncobj (BYTE vol, _SYNC_t* sobj)
{
	if (!vol)
	{
		*sobj = 0;
		return 1;
	}
	return 0;
}
/*----------------------------------------------------------------------
 * Brief: Lock sync object
 -----------------------------------------------------------------------*/
int ff_req_grant (_SYNC_t sobj)
{
	if (!sobj)
	{
		u16 t = 0;

		while (disk0busy)
		{
			if(t++ >= (_FS_TIMEOUT / 100))
			{
				TermPrint_logSDC("--ff_req_grant[Disk0busy]");
				return 0;
			}
			DELAY_10ms(10);
		}
		disk0busy = 1;
		return 1;
	}
	return 0;
}
/*----------------------------------------------------------------------
 * Brief: Unlock sync object
 -----------------------------------------------------------------------*/
void ff_rel_grant (_SYNC_t sobj)
{
	if (!sobj)
	{
		disk0busy = 0;
	}
}
/*----------------------------------------------------------------------
 * Brief: Delete a sync object
 -----------------------------------------------------------------------*/
int ff_del_syncobj (_SYNC_t sobj)
{
	return 1;
}
#endif
